#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.aws_cf_sns_stack will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "aws_cf_sns_stack"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + AWSTemplateFormatVersion = "2010-09-09"
              + Resources                = {
                  + EmailSNSTopicSubscription = {
                      + Properties = {
                          + Endpoint = "${sns_subscription_list}"
                          + Protocol = "email"
                          + TopicArn = "${sns_topic_arn}"
                        }
                      + Type       = "AWS::SNS::Subscription"
                    }
                }
            }
        )
      + vars     = {
          + "sns_subscription_list" = "v8oz21jn9@relay.firefox.com"
          + "sns_topic_arn"         = (known after apply)
        }
    }

  # aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + certificate_body          = (known after apply)
      + domain_name               = (known after apply)
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + private_key               = (sensitive value)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = (known after apply)
    }

  # aws_cloudformation_stack.tf_sns_topic_subscription will be created
  + resource "aws_cloudformation_stack" "tf_sns_topic_subscription" {
      + id            = (known after apply)
      + name          = "staging-snsStack"
      + outputs       = (known after apply)
      + parameters    = (known after apply)
      + policy_body   = (known after apply)
      + template_body = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.cpu[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "cpu" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors ec2 cpu utilization"
      + alarm_name                            = "staging-hello-world-cpu"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 120
      + statistic                             = "Average"
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_elastic_beanstalk_application.app will be created
  + resource "aws_elastic_beanstalk_application" "app" {
      + arn         = (known after apply)
      + description = "A hello world webserver"
      + id          = (known after apply)
      + name        = "staging-hello-world"
    }

  # aws_elastic_beanstalk_application_version.this will be created
  + resource "aws_elastic_beanstalk_application_version" "this" {
      + application  = "staging-hello-world"
      + arn          = (known after apply)
      + bucket       = (known after apply)
      + description  = "A hello world webserver"
      + force_delete = false
      + id           = (known after apply)
      + key          = (known after apply)
      + name         = (known after apply)
    }

  # aws_elastic_beanstalk_environment.this will be created
  + resource "aws_elastic_beanstalk_environment" "this" {
      + all_settings           = (known after apply)
      + application            = "staging-hello-world"
      + arn                    = (known after apply)
      + autoscaling_groups     = (known after apply)
      + cname                  = (known after apply)
      + cname_prefix           = (known after apply)
      + description            = "An environment for a hello world webserver"
      + endpoint_url           = (known after apply)
      + id                     = (known after apply)
      + instances              = (known after apply)
      + launch_configurations  = (known after apply)
      + load_balancers         = (known after apply)
      + name                   = "staging-hello-world"
      + platform_arn           = (known after apply)
      + queues                 = (known after apply)
      + solution_stack_name    = "64bit Amazon Linux 2 v3.2.0 running Python 3.8"
      + tier                   = "WebServer"
      + triggers               = (known after apply)
      + version_label          = (known after apply)
      + wait_for_ready_timeout = "20m"

      + setting {
          + name      = "BreachDuration"
          + namespace = "aws:autoscaling:trigger"
          + value     = "5"
        }
      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "staging-eb-ec2"
        }
      + setting {
          + name      = "InstancePort"
          + namespace = "aws:elb:listener:443"
          + value     = "80"
        }
      + setting {
          + name      = "InstanceTypes"
          + namespace = "aws:ec2:instances"
          + value     = "t2.micro"
        }
      + setting {
          + name      = "ListenerEnabled"
          + namespace = "aws:elb:listener"
          + value     = "false"
        }
      + setting {
          + name      = "ListenerEnabled"
          + namespace = "aws:elb:listener:443"
          + value     = "true"
        }
      + setting {
          + name      = "ListenerProtocol"
          + namespace = "aws:elb:listener:443"
          + value     = "HTTPS"
        }
      + setting {
          + name      = "MaxSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "4"
        }
      + setting {
          + name      = "MinSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "1"
        }
      + setting {
          + name      = "SSLCertificateId"
          + namespace = "aws:elb:listener:443"
          + value     = (known after apply)
        }
    }

  # aws_iam_instance_profile.ec2 will be created
  + resource "aws_iam_instance_profile" "ec2" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "staging-eb-ec2"
      + path        = "/"
      + role        = "staging-eb-ec2"
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ec2 will be created
  + resource "aws_iam_role" "ec2" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ssm.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-eb-ec2"
      + path                  = "/"
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.service will be created
  + resource "aws_iam_role" "service" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "elasticbeanstalk.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-eb-service"
      + path                  = "/"
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.default will be created
  + resource "aws_iam_role_policy" "default" {
      + id     = (known after apply)
      + name   = "staging-eb-default"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:GetQueueUrl",
                          + "sqs:GetQueueAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeInstanceHealth",
                          + "ec2:GetConsoleOutput",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceStatus",
                          + "ec2:DescribeAddresses",
                          + "ec2:AssociateAddress",
                          + "autoscaling:DescribeScalingActivities",
                          + "autoscaling:DescribeNotificationConfigurations",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeAutoScalingGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "sqs:GetQueueUrl",
                          + "sqs:GetQueueAttributes",
                          + "sns:Subscribe",
                          + "sns:ListSubscriptionsByTopic",
                          + "sns:GetTopicAttributes",
                          + "sns:CreateTopic",
                          + "s3:ListBucket",
                          + "s3:GetObjectAcl",
                          + "s3:GetObject",
                          + "rds:DescribeOrderableDBInstanceOptions",
                          + "rds:DescribeDBInstances",
                          + "rds:DescribeDBEngineVersions",
                          + "logs:PutRetentionPolicy",
                          + "logs:CreateLogGroup",
                          + "iam:PassRole",
                          + "iam:ListRoles",
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:RegisterInstancesWithLoadBalancer",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeInstanceHealth",
                          + "elasticloadbalancing:DeregisterTargets",
                          + "elasticloadbalancing:DeregisterInstancesFromLoadBalancer",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:ConfigureHealthCheck",
                          + "elasticloadbalancing:ApplySecurityGroupsToLoadBalancer",
                          + "elasticbeanstalk:*",
                          + "ecs:RegisterTaskDefinition",
                          + "ecs:DescribeClusters",
                          + "ecs:DeleteCluster",
                          + "ecs:CreateCluster",
                          + "ec2:TerminateInstances",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupEgress",
                          + "ec2:ReleaseAddress",
                          + "ec2:DisassociateAddress",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSnapshots",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeKeyPairs",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeImages",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DeleteSecurityGroup",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:AuthorizeSecurityGroupEgress",
                          + "ec2:AssociateAddress",
                          + "ec2:AllocateAddress",
                          + "codebuild:StartBuild",
                          + "codebuild:DeleteProject",
                          + "codebuild:CreateProject",
                          + "codebuild:BatchGetBuilds",
                          + "cloudwatch:PutMetricAlarm",
                          + "autoscaling:UpdateAutoScalingGroup",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "autoscaling:SuspendProcesses",
                          + "autoscaling:SetDesiredCapacity",
                          + "autoscaling:ResumeProcesses",
                          + "autoscaling:PutScheduledUpdateGroupAction",
                          + "autoscaling:DetachInstances",
                          + "autoscaling:DescribeScheduledActions",
                          + "autoscaling:DescribeScalingActivities",
                          + "autoscaling:DescribeNotificationConfigurations",
                          + "autoscaling:DescribeLoadBalancers",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeAutoScalingGroups",
                          + "autoscaling:DescribeAccountLimits",
                          + "autoscaling:DeleteScheduledAction",
                          + "autoscaling:DeleteLaunchConfiguration",
                          + "autoscaling:DeleteAutoScalingGroup",
                          + "autoscaling:CreateLaunchConfiguration",
                          + "autoscaling:CreateAutoScalingGroup",
                          + "autoscaling:AttachInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowOperations"
                    },
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::*"
                      + Sid      = "AllowS3OperationsOnElasticBeanstalkBuckets"
                    },
                  + {
                      + Action   = "logs:DeleteLogGroup"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:log-group:/aws/elasticbeanstalk*"
                      + Sid      = "AllowDeleteCloudwatchLogGroups"
                    },
                  + {
                      + Action   = "cloudformation:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:cloudformation:*:*:stack/eb-*",
                          + "arn:aws:cloudformation:*:*:stack/awseb-*",
                        ]
                      + Sid      = "AllowCloudformationOperationsOnElasticBeanstalkStacks"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.elastic_beanstalk_multi_container_docker will be created
  + resource "aws_iam_role_policy_attachment" "elastic_beanstalk_multi_container_docker" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkMulticontainerDocker"
      + role       = "staging-eb-ec2"
    }

  # aws_iam_role_policy_attachment.service will be created
  + resource "aws_iam_role_policy_attachment" "service" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSElasticBeanstalkService"
      + role       = "staging-eb-service"
    }

  # aws_s3_bucket.dist_bucket will be created
  + resource "aws_s3_bucket" "dist_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "staging-elb-dist"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_object.dist_item will be created
  + resource "aws_s3_bucket_object" "dist_item" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./dist/app.zip"
      + storage_class          = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_sns_topic.alert_sns_topic will be created
  + resource "aws_sns_topic" "alert_sns_topic" {
      + arn             = (known after apply)
      + delivery_policy = jsonencode(
            {
              + http = {
                  + defaultHealthyRetryPolicy    = {
                      + backoffFunction    = "exponential"
                      + maxDelayTarget     = 20
                      + minDelayTarget     = 20
                      + numMaxDelayRetries = 0
                      + numMinDelayRetries = 0
                      + numNoDelayRetries  = 0
                      + numRetries         = 3
                    }
                  + defaultThrottlePolicy        = {
                      + maxReceivesPerSecond = 1
                    }
                  + disableSubscriptionOverrides = false
                }
            }
        )
      + id              = (known after apply)
      + name            = "staging-hello-world"
      + policy          = (known after apply)
    }

  # tls_private_key.this will be created
  + resource "tls_private_key" "this" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # tls_self_signed_cert.this will be created
  + resource "tls_self_signed_cert" "this" {
      + allowed_uses          = [
          + "key_encipherment",
          + "digital_signature",
          + "server_auth",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + key_algorithm         = "RSA"
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 12
      + validity_start_time   = (known after apply)

      + subject {
          + common_name  = "staging.helloworld.com"
          + organization = "Hello World"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_version = (known after apply)
  + env_name    = "staging-hello-world"
  + env_url     = (known after apply)

------------------------------------------------------------------------

This plan was saved to: terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.plan"


```
</details>
*Pusher: @davegallant, Action: `pull_request`*